In [2]:
salary = {'Tim':3000,'Sam':34000}

In [6]:
salary

{'Tim': 3000, 'Sam': 34000}

In [8]:
from pandas import Series

In [9]:
s3 = Series(salary)

In [10]:
s3

Tim     3000
Sam    34000
dtype: int64

In [12]:
s3['Tim']

3000

In [15]:
from pandas import DataFrame

In [16]:
data = {'Name':['John','Tin','Rob'],
        'Age':[32,45,64],
        'Salary':[4000,60000,10000]
       }

In [17]:
frame = DataFrame(data)

In [18]:
frame

   Name  Age  Salary
0  John   32    4000
1   Tin   45   60000
2   Rob   64   10000

In [26]:
frame = DataFrame(data,columns=["Age","Name","Salary","id"])

In [27]:
frame

   Age  Name  Salary   id
0   32  John    4000  NaN
1   45   Tin   60000  NaN
2   64   Rob   10000  NaN

In [39]:
frame.loc[:, ['Age', 'Name']]

   Age  Name
0   32  John
1   45   Tin
2   64   Rob

In [41]:
frame.iloc[2]

Age          64
Name        Rob
Salary    10000
id          NaN
Name: 2, dtype: object

In [43]:
obj = Series([100,200,300,400],index=['a','b','c','d'])
obj

a    100
b    200
c    300
d    400
dtype: int64

In [47]:
obj = obj.reindex(['a','c','b','d'])
obj

a    100
c    300
b    200
d    400
dtype: int64

In [49]:
frame_r_1 = frame.reindex([2,1,0])
frame_r_1

   Age  Name  Salary   id
2   64   Rob   10000  NaN
1   45   Tin   60000  NaN
0   32  John    4000  NaN

In [54]:
new = ['Salary','Age','Name']
frame_r_2 = frame.reindex(columns=new)
frame_r_2

   Salary  Age  Name
0    4000   32  John
1   60000   45   Tin
2   10000   64   Rob

In [57]:
frame_r_2['Profile'] = ['Doctor','Nurse','Player']

In [58]:
frame_r_2

   Salary  Age  Name Profile
0    4000   32  John  Doctor
1   60000   45   Tin   Nurse
2   10000   64   Rob  Player

In [60]:
frame_r_2 = frame_r_2.T
frame_r_2

              0      1       2
Salary     4000  60000   10000
Age          32     45      64
Name       John    Tin     Rob
Profile  Doctor  Nurse  Player

In [61]:
frame_r_2 = frame_r_2.T
frame_r_2

  Salary Age  Name Profile
0   4000  32  John  Doctor
1  60000  45   Tin   Nurse
2  10000  64   Rob  Player

In [68]:
frame_1 = frame.drop({1})
frame_1

   Age  Name  Salary   id
0   32  John    4000  NaN
2   64   Rob   10000  NaN

In [74]:
frame_2 = frame.drop('id', axis=1)
frame_2

   Age  Name  Salary
0   32  John    4000
1   45   Tin   60000
2   64   Rob   10000

In [80]:
series1 = Series([1,2,3,4,5])
series2 = Series([100,200,300,400,500,600])
series1+series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [101]:
data1 =  {'Name':['John','Tin','Rob'],
        'Age':[32,45,64],
        'Salary':[4000,60000,10000]
       }
frame1 = DataFrame(data1,columns=['Age','Salary'])

In [102]:
data2 = {'Name':['John','Tin','Ron'],
        'Age':[3,4,6],
        'Salary':[400,6000,1000]
       }
frame2 = DataFrame(data2,columns=['Age','Salary'])

In [103]:
frame1+frame2

   Age  Salary
0   35    4400
1   49   66000
2   70   11000

In [119]:
series3 = Series([100,200,300],index = ['Speed','Temp','Humidity'])
series3

Speed       100
Temp        200
Humidity    300
dtype: int64

In [115]:
data3 = {
    'Temp':[34,23,42],
    'Humidity':[45,23,58],
    'Speed':[101,109,106]
}
frame3 = DataFrame(data3)

In [121]:
frame3-series3

   Humidity  Speed  Temp
0      -255      1  -166
1      -277      9  -177
2      -242      6  -158

In [126]:
series5 = Series([1,4,6,2,34,6,78,9],index=[1,4,5,7,3,6,9,2])
series5

1     1
4     4
5     6
7     2
3    34
6     6
9    78
2     9
dtype: int64

In [128]:
series5.sort_index()

1     1
2     9
3    34
4     4
5     6
6     6
7     2
9    78
dtype: int64

In [129]:
frame3

   Temp  Humidity  Speed
0    34        45    101
1    23        23    109
2    42        58    106

In [131]:
frame3 = frame3.reindex([2,0,1])
frame3

   Temp  Humidity  Speed
2    42        58    106
0    34        45    101
1    23        23    109

In [133]:
frame3.sort_index()

   Temp  Humidity  Speed
0    34        45    101
1    23        23    109
2    42        58    106

In [134]:
frame3 = frame3.reindex(columns=['Speed','Humidity','Temp'])
frame3

   Speed  Humidity  Temp
2    106        58    42
0    101        45    34
1    109        23    23

In [137]:
frame3.sort_index(axis=1,ascending=False)

   Temp  Speed  Humidity
2    42    106        58
0    34    101        45
1    23    109        23

In [146]:
series5.sort_values()

1     1
7     2
4     4
5     6
6     6
2     9
3    34
9    78
dtype: int64

In [141]:
frame3

   Speed  Humidity  Temp
2    106        58    42
0    101        45    34
1    109        23    23

In [145]:
frame3.sort_values(by='Humidity')

   Speed  Humidity  Temp
1    109        23    23
0    101        45    34
2    106        58    42

In [148]:
series5.index.is_unique

True

In [149]:
frame3.sum()

Speed       316
Humidity    126
Temp         99
dtype: int64

In [151]:
frame3.sum(axis=1)

2    206
0    180
1    155
dtype: int64

In [159]:
frame3.idxmax()

Speed       1
Humidity    2
Temp        2
dtype: int64

In [160]:
frame3.idxmin()

Speed       0
Humidity    1
Temp        1
dtype: int64

In [161]:
import numpy as np

In [167]:
series5 = Series([1,4,3,np.nan],index=['a','b','c','d'])
series5

a    1.0
b    4.0
c    3.0
d    NaN
dtype: float64

In [168]:
series5.dropna()

a    1.0
b    4.0
c    3.0
dtype: float64

In [169]:
series5

a    1.0
b    4.0
c    3.0
d    NaN
dtype: float64

In [171]:
series5=series5.dropna()
series5

a    1.0
b    4.0
c    3.0
dtype: float64

In [174]:
data2 =  {'Name':['John','Tin','Rob'],
        'Age':[32,np.nan,64],
        'Salary':[4000,60000,np.nan]
       }
frame1 = DataFrame(data2)
frame1

   Name   Age   Salary
0  John  32.0   4000.0
1   Tin   NaN  60000.0
2   Rob  64.0      NaN

In [175]:
frame1.dropna()

   Name   Age  Salary
0  John  32.0  4000.0

In [177]:
frame1.fillna(0)

   Name   Age   Salary
0  John  32.0   4000.0
1   Tin   0.0  60000.0
2   Rob  64.0      0.0

In [178]:
import pandas as pd

In [180]:
data_frame = pd.read_csv('meal(Oct- ).csv')
data_frame

,Date,shuvro,maruf vai,Unnamed: 3,Unnamed: 4,bazar,Unnamed: 6
0,"Tuesday, October 3, 2023",1.0,1.0,NaN,NaN,shuvro,Maruf vai
1,"Wednesday, October 4, 2023",2.0,3.0,NaN,NaN,490,NaN
2,"Thursday, October 5, 2023",1.0,0.0,NaN,NaN,165,NaN
3,"Friday, October 6, 2023",0.0,0.0,NaN,NaN,86,NaN
4,"Saturday, October 7, 2023",1.0,0.0,NaN,NaN,440,NaN
5,"Sunday, October 8, 2023",2.0,0.0,NaN,NaN,392,NaN
6,"Monday, October 9, 2023",2.0,0.0,NaN,NaN,420,NaN
7,"Tuesday, October 10, 2023",2.0,2.0,NaN,NaN,370,NaN
8,"Wednesday, October 11, 2023",2.0,2.0,NaN,NaN,90,NaN
9,"Thursday, October 12, 2023",2.0,2.0,NaN,NaN,NaN,NaN
10,"Friday, October 13, 2023",2.0,2.0,NaN,NaN,NaN,NaN
11,"Saturday, October 14, 2023",2.0,2.0,NaN,NaN,NaN,NaN
12,"Sunday, October 15, 2023",1.0,1.0,NaN,NaN,NaN,NaN
13,"Monday, October 16, 2023",1.0,1.0,NaN,NaN,NaN,NaN
14,"Tuesday, October 17, 2023",1.0,1.0,NaN,NaN,NaN,NaN
15,"Wednesday, October 18, 2023",1.0,1.0,NaN,NaN,NaN,NaN
16,"Thursday, October 19, 2023",1.0,1.0,NaN,NaN,NaN,NaN
17,"Friday, October 20, 2023",1.0,1.0,NaN,NaN,NaN,NaN
18,"Saturday, October 21, 2023",2.0,2.0,NaN,NaN,NaN,NaN
19,"Sunday, October 22, 2023",2.0,NaN,NaN,NaN,NaN,NaN
20,"Monday, October 23, 2023",2.0,NaN,NaN,NaN,NaN,NaN
21,"Tuesday, October 24, 2023",2.0,NaN,NaN,NaN,NaN,NaN
22,"Wednesday, October 25, 2023",2.0,NaN,NaN,NaN,NaN,NaN
23,"Thursday, October 26, 2023",1.0,NaN,NaN,NaN,NaN,NaN
24,"Friday, October 27, 2023",0.0,NaN,NaN,NaN,NaN,NaN
25,"Saturday, October 28, 2023",NaN,NaN,NaN,NaN,NaN,NaN
26,"Sunday, October 29, 2023",NaN,NaN,NaN,NaN,NaN,NaN
27,"Monday, October 30, 2023",NaN,NaN,NaN,NaN,NaN,NaN
28,"Tuesday, October 31, 2023",NaN,NaN,NaN,NaN,NaN,NaN
29,"Wednesday, November 1, 2023",NaN,NaN,NaN,NaN,NaN,NaN
30,"Thursday, November 2, 2023",NaN,NaN,NaN,NaN,NaN,NaN
31,"Friday, November 3, 2023",NaN,NaN,NaN,NaN,NaN,NaN
32,"Saturday, November 4, 2023",NaN,NaN,NaN,NaN,NaN,NaN
33,"Sunday, November 5, 2023",NaN,NaN,NaN,NaN,NaN,NaN
34,"Monday, November 6, 2023",NaN,NaN,NaN,NaN,NaN,NaN
35,"Tuesday, November 7, 2023",NaN,NaN,NaN,NaN,NaN,NaN
36,"Wednesday, November 8, 2023",NaN,NaN,NaN,NaN,NaN,NaN
37,"Thursday, November 9, 2023",NaN,NaN,NaN,NaN,NaN,NaN
38,"Friday, November 10, 2023",NaN,NaN,NaN,NaN,NaN,NaN
39,"Saturday, November 11, 2023",NaN,NaN,NaN,NaN,NaN,NaN
40,"Sunday, November 12, 2023",NaN,NaN,NaN,NaN,NaN,NaN
41,"Monday, November 13, 2023",NaN,NaN,NaN,NaN,NaN,NaN
42,"Tuesday, November 14, 2023",NaN,NaN,NaN,NaN,NaN,NaN
43,"Wednesday, November 15, 2023",NaN,NaN,NaN,NaN,NaN,NaN
44,"Thursday, November 16, 2023",NaN,NaN,NaN,NaN,NaN,NaN
45,"Friday, November 17, 2023",NaN,NaN,NaN,NaN,NaN,NaN
46,"Saturday, November 18, 2023",NaN,NaN,NaN,NaN,NaN,NaN
47,"Sunday, November 19, 2023",NaN,NaN,NaN,NaN,NaN,NaN
48,"Monday, November 20, 2023",NaN,NaN,NaN,NaN,NaN,NaN
49,"Tuesday, November 21, 2023",NaN,NaN,NaN,NaN,NaN,NaN
50,"Wednesday, November 22, 2023",NaN,NaN,NaN,NaN,NaN,NaN
51,"Thursday, November 23, 2023",NaN,NaN,NaN,NaN,NaN,NaN
52,"Friday, November 24, 2023",NaN,NaN,NaN,NaN,NaN,NaN
53,"Saturday, November 25, 2023",NaN,NaN,NaN,NaN,NaN,NaN
54,"Sunday, November 26, 2023",NaN,NaN,NaN,NaN,NaN,NaN
55,"Monday, November 27, 2023",NaN,NaN,NaN,NaN,NaN,NaN
56,"Tuesday, November 28, 2023",NaN,NaN,NaN,NaN,NaN,NaN
57,"Wednesday, November 29, 2023",NaN,NaN,NaN,NaN,NaN,NaN
58,"Thursday, November 30, 2023",NaN,NaN,NaN,NaN,NaN,NaN